//1. Дан список из числовых данных.
//С помощью итератора:
//a). Напечатать только четные числа из списка.
//b). Удалить из списка все числа, заканчивающиеся на 0.
//c). Составить список квадратов чисел.
package de.telran.lesson20240214practice;

import java.util.*;

public class SimpleList {
//    public static <Integers> void main(String[] args) {
//        List<Integer> list2 = Arrays.asList(1,2,3,4,5,6);
//        Iterator<Integers> iterator2 = list2.listIterator();
//        while (iterator2.hasNext())
//            if(iterator2.next () % 2 == 0){
//            System.out.println(iterator2.next());
//    }
//    }
}
