// -- -- -- -- -- -- -- -- -- --arrays-- -- -- -- -- -- -- -- -- --
// let arr = [4, 6, 12, 0, 36, "Hello", true, 7]
// console.log(arr)
// console.log(arr[5]) //Hello
// console.log(arr[2]) //12
// console.log(arr[8]) //undefined
// console.log(arr.length) //длину массива (количество элементов)
// console.log(arr[arr.length - 1]) //7
// arr[5] = "World"
// console.log(arr[5]) //Hello
// arr[2] = arr
// console.log(arr)
// let arr2 = [
//   [1, 4, 4, 6, 5],
//   [1, 6, 5, 3]
// ]
// console.log(arr2[1][3]) //3

// push pop
// arr.push(15, "John", -9, 65) // добавить элементы в массив в конец
// console.log(arr)

// let lastElem = arr.pop() // pop удаляет и возвращает последний элемент из массива
// console.log(arr)
// console.log(`lastElem=${lastElem}`)

//   -- -- -- -- -- -- -- -- -- --задача-- -- -- -- -- -- -- -- -- --
// Написать программу, в которой объявлен массив с 5 числовыми элементами.Программа должна заполнить новый пустой массив квадратами чисел из первого массива.

// Пример:
//   Исходный массив[1, 4, 2, 5, 3]
// Итоговый массив[1, 16, 4, 25, 9]

// let firstArr = [1, 4, 2, 5, 3]

// for (let i in firstArr) {
//   firstArr[i] = firstArr[i] ** 2;
// }
// console.log(firstArr)

// const firstArr = [1, 4, 2, 5, 3]
// const resultArr = []
// resultArr.push(firstArr[0] ** 2, firstArr[1] ** 2, firstArr[2] ** 2, firstArr[3] ** 2, firstArr[4] ** 2)
// console.log(resultArr)

//   -- -- -- -- -- -- -- -- -- --
// for -- -- -- -- -- -- -- -- -- --
// for (начальное значение счетчика; условие выполнения; изменение значения счетчика)
//   for (let i = 0; i <= 10; i++) {
//     console.log(i) //0 1 ... 10
//   }
// num = 5
// 1) i = i + 1;
// i = i * 2
// 2) i += 1;
// i *= 2
// 3) i++
// 4) ++i
// -- -- -- -- -- -- -- -- -- --задача-- -- -- -- -- -- -- -- -- --
// Разобрать пример вывода всех элементов массива при помощи цикла
// for.
// const arr = [1, 4, 2, 5, 3] // arr[0] arr[1] arr[3] arr[4]
// console.log(`arr = ${arr}`)
// for (let i = 0; i <= arr.length - 1; i++) {
//   console.log(arr[i] ** 2) // 0 2  3 4 5 ... 8 9 10
// }
// -- -- -- -- -- -- -- -- -- --задача 2-- -- -- -- -- -- -- -- -- --
// Написать цикл, который выводит только четные числа.
// const arr = [1, 4, -2, 5, 3, -6, 24, 13, 16, 15, 92]
// for (let i in arr) {
//   if (arr[i] % 2 === 0)
//     console.log(arr[i])
// }

// -- -- -- -- -- -- -- -- -- --задача 3-- -- -- -- -- -- -- -- -- --
// Разобрать синтаксис цикла с изменением i на два, три и так далее. 
// for(let i=0; i<21; i+=2){
//  console.log(i)
// }

// -- -- -- -- -- -- -- -- -- --задача 4-- -- -- -- -- -- -- -- -- --
// Разбор синтаксиса цикла от большего к меньшему 
// const arr = [1, 4, -2, 5, 3, -6, 24, 13, 15, 92]
// for (let i = arr.length - 1; i >= 0; i -= 1) { //20->0
//   console.log(arr[i])}
// -- -- -- -- -- -- -- -- -- --задача 5-- -- -- -- -- -- -- -- -- --
// Разбор задачи на поиск агрегации по массиву. На примере суммы всех элементов массива.

const arr = [1, 4, -2, 5, 3, -6, 24, 13, 15, 92]
let sum = 0
for (let i =  0; i < arr.length; i++) { // arr[0] arrr[1] 2 3 4 5
  // sum = sum + arr[i]
  sum += arr[i]
}
console.log(sum)