// https://docs.google.com/document/d/1K9mudqA6yufWhX0bl-j3S347z3N-dh8r/edit#heading=h.gjdgxs
//================================ Задача 01 ================================
// Создать в html форму с тремя инпутами (имя, фамилия, возраст). Написать скрипт, который при отправке формы выводит собранные данные в консоль.
//================================ Задача 02 ================================
// Доработать процесс таким образом, чтобы при отправке формы данные из нее добавлялись в массив users в виде объекта.
//================================ Задача 03 ================================
// Реализовать функцию rerender. Эта функция очищает контейнер с карточками и создает множество карточек с пользователями из массива. Настроить rerender при добавлении нового пользователя.
//================================ Задача 04 ================================
// Доработать rerender таким образом, чтобы при двойном клике по карточке из массива удалялся пользователь по id и вызывался rerender.

//================================ Задача 05 ================================
// Второстепенные задачи:
// 1 - добавить валидацию данных:
// запретить добавления пользователя с пустыми значениями
// сделать ограничение количества символов для имени и фамилии
// Пример: мин - 2 символа, макс - 16
//================================ Задача 06 ================================
// 2 - если данные не проходят валидацию сообщения показать в виде красного текста внутри формы либо под формой добавления пользователя, если всё нормально убрать красный текст
//================================ Задача 07 ================================
// 3 - добавить сортировку по имени, фамилии, возрасту и сделать так чтобы можно было выбрать либо по убыванию либо по возрастанию