//Домашнее задание
//1. Quick sort пишем еще раз "с чистого листа"
//Выбираем опорный элемент из массива. Как правило, это средний элемент.
//Делим массив на 2 подмассива. Элементы, которые меньше опорного, и элементы, которые больше опорного. 1
//Рекурсивно применяем сортировку к обоим подмассивам.
//В результате массивы будут делиться до тех пор, пока не останется один злемєнт,
//который потом отсортируется.
//2*. Реализовать Quick sort используя итерационный подход.
package de.telran.algorithms20240313;

public class Sort {
}
