public class Main {import java.util.Scanner;

    public class Time {
        //    Описание задания.
//            1 уровень сложности: №1
//
//    Создать программу, выводящую на экран ближайшее к 10 из двух чисел, записанных в переменные m и n.
//    Числа могут быть, как целочисленные, так и дробные.
//
//    Например :
//    ввод : m=10.5, n=10.45
//    вывод: Число 10.45 ближе к 10.
//
//    public static void main(String[] args) {
//
//        Scanner sc = new Scanner(System.in);
//        System.out.println("Введите первое число");//10.5
//        String str1 = sc.nextLine();
//        double num1 = Double.parseDouble(str1);
//        Scanner scr = new Scanner(System.in);
//        System.out.println("Введите второе число");//10.45
//        String str2 = scr.nextLine();
//        double num2 = Double.parseDouble(str2);
//        double a = 10;
//        double number1 = a - num1;
//        double number2 = a - num2;
//        if (number1 > number2) {
//            System.out.println(num1);//10.45
//        } else {
//            System.out.println(num2);
//        }
//    }

}
