public class Test {
}
/*      1. Разработчик - это...
        a. компьютер, который контролирует выполнение кода.
        +b. кто-то, кто пишет код на любом языке программирования.
        c. тот, кто вносит изменения в написанный код.
        2. Кто такой Джеймс Гослинг?
        a. Телезвезда.
        +b. Автор объектно-ориентированного языка программирования.
        c. Генеральный директор корпорации Oracle.
        3. Компьютерная программа - это...
        a. комбинация данных.
        +b. комбинация компьютерных инструкций и данных.
        c. правила компьютера.
        4. Алгоритм - это...
        a. то, что делает компьютер.
        +b. конечный набор четко определенных правил.
        c. слово из Википедии.
        5. JVM...
        +a. позволяет запускать Java-программы на любом устройстве.
        b. это набор инструментов разработчика Java.
        c. управляет и оптимизирует программную память.
        d. компилятор, который преобразует код Java в байт-код.
        6. Класс в Java - это...
        +a. шаблон для создания объекта.
        b. шаблон для создания метода.
        c. что-то, чему мы не научились.
        d. то, что мы запускаем, когда пишем в консоли '-java Class.'
        7. Выберите типы переменных в Java:
        +a. Локальные переменные
        b. Переменные константы
        c. Частные переменные
        +d. Переменные экземпляра
        +e. Статические переменные
        8. Выберите примитивные типы данных в Java:
        +a. Boolean
        +b. long
        c. Object
        +d. int
        e. Cat
        +f. char
        g. String
        9. Математическая операция в Java 44 / 33 = ?
        a. 33
        b. 44
        c. 0
        d. 0.15637
        +e. 1
        f. 1.0
        10. Математическая операция в Java 44 % 33 = ?
        a. 33
        b. 1
        +c. 11
        d. 0.11
        e. 1.0
        11. Какой тип данных самый большой?
        a. boolean
        b. int
        +c. long
        d. char
        12. Строка - это...
        +a. массив символов
        b. тип данных
        c. объект
        d. класс в Java
        e. все вышеперечисленное
        13. Объект - это..
        +a. класс
        b. метод
        c. программа
        d. алгоритм
        14. Как передается тип int в Java?
        a. по ссылке
        b. по типу
        +c. по значению
        d. по Wi-Fi
        e. через Интернет
        15. Что это за система счисления? -> 888
        +a. Octo
        b. Decimal
        c. Binary
        d. Hex
        16. Выберите правильное имя класса (в соответствии с соглашениями):
        +a. Student
        b. _Student
        c. studentRun
        +d. RunStudent
        e. S
        f. STUDENT_RUN
        g. 123Student
        17. Выберите правильное имя метода (в соответствии с соглашениями):
        a. Student
        b. _student
        +c. runStudent
        d. run_student
        e. RunStudent
        +f. run
        18. Модификаторы доступа в Java...
        +a. public.
        +b. private.
        c. final.
        d. static.
        19. Что верно для статических переменных?
        +a. единственная копия
        b. много копий
        c. доступ через имя класса
        d. изменения не отражаются
        20. Выберите явное преобразование типа (сужение):
        a. int -> long
        +b. long -> int
        +c. double -> byte
        +d. float -> int
        21. "I am doing a test".charAt(3);
        a.  " " (space)
        b. a
        +c. m
        d. d
        22. "I am doing a test".substring(3, 6);
        a. md
        b. m
        c. amd
        d. am
        +e. m d
        f. I am doing a test
        23. Что может произойти при вызове метода?
        +a. метод достигает оператора возврата (return)
        b. метод не достигает оператора возврата
        c. ничего не случится
        d. что-то плохое происходит внутри программы
        e. метод вызовет исключение
        24. Выберите, какой метод будет точкой входа?
        a
            public void main (String[] args) {
            int idx = 0;
            idx++; idx--;
            out.println(idx);
            }
        +b
            public static void main (String[] strings) {
            int idx = 0;
            idx++; idx--; out.println(idx);
            }
        c
            public static int main(String[] args) {
            int idx = 0;
            idx++; idx--; out.println(idx);
            return idx;
            }
        d
            public static void myMain(String[] args) {
            int idx = 0;
            idx++; idx--;
            out.println(idx);
            }
        25. Что напечатает этот метод?
        public class Test {
            public void test () {
            int idx = 0;
            idx++;
            idx--:
            idx = idx + 1;
            idx = -1;
            idx = idx % idx;
            if (idx › 0) {
            --idx;
            else {
            idx++;
            System.out.println((double) idx);
            }
        }
        a. java.lang.ArithmeticException
        b. 1
        c. 0
        d. 1.0
        e. 2.0
        f. 0.0
        g. -1.0
        +h. complete nonsense, it won't work
    */