//        Описание задания.
//        1 уровень сложности:
//        1. Создайте две переменные isEdekaOpen и isReweOpen, значения которых зависят от того, открыты магазины или нет.
//        Реализует логический метод canBuy,  возвращающий boolean
//        Значение этой переменной должно быть true, если хотя бы один магазин открыт, иначе false.
//        Отобразите строку «Я могу купить еду, это ……» и значение.
//
//
//       2. Реализуйте программу, которая попросит пользователя ввести год и напечатать этот год isLeap (високосный) или нет.
//
//       3. Реализуйте программу, которая попросит пользователя ввести три целых числа (используйте сканер) и напечатает максимум из трех чисел.
//
//
//      4.  *Дополнительно
//        Для введённого пользователем с клавиатуры натурального числа посчитайте сумму всех его цифр (заранее не известно сколько цифр будет в числе).
//
//        Например:
//        Ввод = 12345
//        Вывод = 1+2+3+4+5 = 15

public class Main {
    public static void main(String[] args) {

    }
}
